---
kind: enumMember
id: F:Autodesk.Revit.DB.PlanViewRangeError.ViewDepthBelowTopClip
enum: Autodesk.Revit.DB.PlanViewRangeError
source: html/795ce613-6827-e526-23c5-0e60beb090b0.htm
---
# Autodesk.Revit.DB.PlanViewRangeError.ViewDepthBelowTopClip

View depth is below the top clip plane.